Auth against iRacing working, more or less
Were at least handing a JWT back to the browser, but still need to
actually get a session concept going on the frontend
